<?php

/**
 *
 * @author mchubar
 */
function tp_text_show_main($data) {
    ?>
    <div class="textblock">
        <h1>Приветствуем Вас на сайте BALBUM.RU</h1>
        <h2>Зачем нужен этот сайт?</h2>
        <p>В настоящее время активно ведется разработка, так что перед Вами - бета версия сайта.</p>
        <p>Balbum.ru - сайт для ведения детских альбомов. Здесь можно не только постить фотографии, но и вести подробный, настоящий альбом. Сайт сам подскажет, какие события в жизни
            малыша Вы ещё не успели запечатлеть, какие - забыли добавить.</p>
        <p>У нас существуют награды и конкурсы. За каждую награду или победу в конкурсе Вы получаете баллы. Баллы можно тратить</p>
        <p>Главная фишка сайта - не только в общении. Ваши альбомы могут быть превращены в бумажную версию, которую Вы сможете, к примеру, показывать родным за чаем.</p>
        <h2>Зачем я здесь?</h2>
        <p>Вы вполне можете пользоватья всеми функциями сайта, заполнять альбомчики для своих малышей, лайкать и комментировать фотографии из чужих альбомов, получать
            разнообразные награды, участвовать в конкурсах.</p>
        <p>Для меня очень важно получить как можно большее представление о том, что Вам нужно, что Вам не нравится, что хочется поправить, какой функционал кажется
            бесполезным или наоборот, чего не хватает на сайте. Все пожелания можно писать на адрес amuhc@ya.ru.</p>
        <p>Как только сайт выйдет из стадии тестирования, все помощники и советчики получат особенные награды, а особенно активные - большие скидки на наши товары</p>
    </div>
    <?php
}