<?php

/**
 *
 * @author mchubar
 */
function tp_text_show_main($data) {
    ?>
    <div class="textblock">
        <h1>Приветствуем Вас на сайте BALBUM.RU</h1>
        <h2>Зачем нужен этот сайт?</h2>
        <p>В настоящее время активно ведется разработка, так что перед Вами - бета версия сайта.</p>
        <p>Balbum.ru - сайт для ведения детских альбомов. Здесь можно не только постить фотографии, но и вести подробный, настоящий альбом. Сайт сам подскажет, какие события в жизни
            малыша Вы ещё не успели запечатлеть, какие - забыли добавить.</p>
        <p>У нас существуют награды и конкурсы. За каждую награду или победу в конкурсе Вы получаете баллы. Баллы можно тратить</p>
        <p>Главная фишка сайта - не только в общении. Ваши альбомы могут быть превращены в бумажную версию, которую Вы сможете, к примеру, показывать родным за чаем.</p>
        <h2>Зачем я здесь?</h2>
        <p>Вы вполне можете пользоватья всеми функциями сайта, заполнять альбомчики для своих малышей, лайкать и комментировать фотографии из чужих альбомов, получать
            разнообразные награды, участвовать в конкурсах.</p>
        <p>Для меня очень важно получить как можно большее представление о том, что Вам нужно, что Вам не нравится, что хочется поправить, какой функционал кажется
            бесполезным или наоборот, чего не хватает на сайте. Все пожелания можно писать на адрес amuhc@ya.ru.</p>
        <p>Как только сайт выйдет из стадии тестирования, все помощники и советчики получат особенные награды, а особенно активные - большие скидки на наши товары</p>
    </div>
    <?php
}

function tp_text_show_agreement($data) {
    ?>
    <div class="textblock">
        <h1>Пользовательское соглашение<h1>

                <h2>Настоящее Соглашение определяет условия использования Пользователями материалов и сервисов сайта balbum.ru (далее — «Сайт»).</h2>

                <h3>1.Общие условия</h3>

                <p>1.1. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.</p>

                <p>1.2. Настоящее Соглашение является публичной офертой. Получая доступ к материалам Сайта Пользователь считается присоединившимся к настоящему Соглашению.</p>

                <p>1.3. Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего Соглашения. Такие изменения вступают в силу по истечении 3 (Трех) дней с момента размещения новой версии Соглашения на сайте. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование материалов и сервисов Сайта.</p>

                <h3>2. Обязательства Пользователя</h3>

                <p>2.1. Пользователь соглашается не предпринимать действий, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных правах, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта.</p>

                <p>2.2. Использование материалов Сайта без согласия правообладателей не допускается (статья 1270 Г.К РФ). Для правомерного использования материалов Сайта необходимо заключение лицензионных договоров (получение лицензий) от Правообладателей.</p>

                <p>2.3. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна (подпункт 1 пункта 1 статьи 1274 Г.К РФ).</p>

                <p>2.4. Комментарии и иные записи Пользователя на Сайте не должны вступать в противоречие с требованиями законодательства Российской Федерации и общепринятых норм морали и нравственности.</p>

                <p>2.5. Пользователь предупрежден о том, что Администрация Сайта не несет ответственности за посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на сайте.</p>

                <p>2.6. Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.</p>

                <p>2.7. Пользователь принимает положение о том, что все материалы и сервисы Сайта или любая их часть могут сопровождаться рекламой. Пользователь согласен с тем, что Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с такой рекламой.</p>

                <h3>3. Прочие условия</h3>

                <p>3.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации.</p>

                <p>3.2. Ничто в Соглашении не может пониматься как установление между Пользователем и Администрации Сайта агентских отношений, отношений товарищества, отношений по совместной деятельности, отношений личного найма, либо каких-то иных отношений, прямо не предусмотренных Соглашением.</p>

                <p>3.3. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности иных положений Соглашения.</p>

                <p>3.4. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту своих интересов и защиту авторских прав на охраняемые в соответствии с законодательством материалы Сайта.</p>

                <h3>Пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и безусловно принимает их.</h3>
                </div>
                <?php
            }